app/controllers/admins/articles_controller.rb

  def index
    @articles = Article.where(status: 1).order('sort_order IS NULL').order(sort_order: 'ASC', id: 'ASC')
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`status` = 1 ORDER BY sort_order IS NULL, `articles`.`sort_order` ASC, `articles`.`id` ASC

  def create
    @article = Article.new(article_params)
    if @article.save() #save data
---
INSERT INTO `articles` (`title`, `body`, `image_article`, `image_header`, `status`, `category_id`, `publish_date`, `created_at`, `updated_at`) VALUES ('Article test', '<p>dasds</p>', 'Screen_Shot_2019-08-29_at_11.48.42.png', 'Screen_Shot_2019-08-29_at_12.26.30.png', 1, 1, '2019-07-08', '2019-08-30 10:26:03', '2019-08-30 10:26:03')

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params) #save data
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
UPDATE `articles` SET `body` = '<p class=\"lead drop-cap\">fljhsdjkfhjkdshjkfhakdsf</p>\r\n<p>&nbsp;</p>\r\n<p>f</p>\r\n<p>asdf</p>\r\n<p>ads</p>', `updated_at` = '2019-09-01 23:15:22' WHERE `articles`.`id` = 2

  def destroy
    @article = Article.find(params[:id])
    if(@article.update(:status => 0))
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `status` = 0, `updated_at` = '2019-08-30 10:46:03' WHERE `articles`.`id` = 1