app/controllers/admins/banners_controller.rb

  def index
    @banners = Banner.where(status: 1)
---
SELECT `banners`.* FROM `banners` WHERE `banners`.`status` = 1