app/controllers/admins/banners_controller.rb

SELECT `banners`.* FROM `banners` WHERE `banners`.`status` = 1 ORDER BY `deleted_at` ASC, sort_order IS NULL, `banners`.`sort_order` ASC, `banners`.`id` ASC
---
  def index
    @banners = Banner.where(status: 1).order('sort_order IS NULL').order(sort_order: 'ASC', id: 'ASC')

INSERT INTO `banners` (`title`, `image_banner`, `image_alt`, `use_url`, `url`, `category_id`, `status`, `created_at`, `updated_at`) VALUES ('BANNER TEST', 'Screen_Shot_2019-08-29_at_11.48.34__2_.png', 'My facebook', FALSE, 'https://www.facebook.com/andy.1dx', 2, 1, '2019-08-30 08:23:07', '2019-08-30 08:23:07')
---
  def create
    @banner = Banner.new(banner_params)
    if @banner.save() #save data

SELECT  `banners`.* FROM `banners` WHERE `banners`.`id` = 1 LIMIT 1
---
  def edit
    @banner = Banner.find(params[:id])

SELECT  `banners`.* FROM `banners` WHERE `banners`.`id` = 1 LIMIT 1
UPDATE `banners` SET `image_alt` = 'Test', `updated_at` = '2019-08-30 06:02:33' WHERE `banners`.`id` = 1
---
  def update
    @banner = Banner.find(params[:id])
    if @banner.update(banner_params) #save data