app/controllers/admins/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save() #save data
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('TEST', '2019-08-30 02:32:32', '2019-08-30 02:32:32')