app/views/admins/banners/_form.html.erb

              <%= f.label :category %><br />
              <%= f.select :category_id, Category.all.map{ |c| [c.name, c.id] }, { include_blank: 'Please Choose Category' }, { class:"full-width" } %>
---
SELECT `categories`.* FROM `categories`

              <%= f.label :article %><br />
              <%= f.select :article_id, Article.all.map{ |c| [c.title, c.id] }, { include_blank: 'Please Choose Article' }, { class:"full-width" } %>
---
SELECT `articles`.* FROM `articles`

              <%= f.label :sort_order %><br />
              <%= f.select :sort_order, sort_order_collection(Banner.where(status: 1)), { include_blank: true }, { class:"full-width" }%>
---
SELECT `sort_order` FROM `banners` WHERE `banners`.`status` = 1