app/helpers/admins/articles_helper.rb

  def get_prev_articles(article)
  	prev_id = article.id - 1 unless article.id ==  && article.id == 1
  	Article.find(prev_id)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1

  def get_next_articles(article)
  	next_id = article.id + 1
  	nil
  	Article.find(next_id) if Article.exists?(id: next_id)
---
SELECT  1 AS one FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1