app/controllers/articles_controller.rb

  def index
  	@articles = Article.where(status: 1).order(publish_date: 'DESC').page(params[:page]).per(30)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`status` = 1 ORDER BY `articles`.`publish_date` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `articles` WHERE `articles`.`status` = 1