app/controllers/categories_controller.rb

  def show
  	@articles = Article.where(status: 1, category_id: params[:id]).order(publish_date: 'DESC').page(params[:page]).per(30)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`status` = 1 AND `articles`.`category_id` = 4 ORDER BY `articles`.`publish_date` DESC LIMIT 30 OFFSET 0