app/controllers/home_controller.rb

  def index
  	@banners = Banner.where(status: 1).order('sort_order IS NULL').order(sort_order: 'ASC', id: 'ASC').limit(4)
  	@articles = Article.where(status: 1).order(publish_date: 'DESC').page(params[:page]).per(15)
---
SELECT  `banners`.* FROM `banners` WHERE `banners`.`status` = 1 ORDER BY sort_order IS NULL, `banners`.`sort_order` ASC, `banners`.`id` ASC LIMIT 4
SELECT COUNT(*) FROM `articles` WHERE `articles`.`status` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`status` = 1 ORDER BY `articles`.`publish_date` DESC