app/controllers/search_controller.rb

  def show
  	@keyword = params[:keyword]
  	@articles = Article.where(status: 1).where("title like '%#{@keyword}%'").order(publish_date: 'DESC').page(params[:page]).per(15)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`status` = 1 AND (title like '%%') ORDER BY `articles`.`publish_date` DESC LIMIT 15 OFFSET 0