app/views/admins/articles/_form.html.erb

SELECT `categories`.* FROM `categories`
---
              <%= f.label :category %><br />
              <%= f.select :category_id, Category.all.map{ |c| [c.name, c.id] }, { include_blank: 'Please Choose Category' }, { class:"full-width" } %>

SELECT `articles`.* FROM `articles` WHERE `articles`.`status` = 1
---
              <%= f.label :sort_order %><br />
              <%= f.select :sort_order, sort_order_collection(Article.where(status: 1)), { include_blank: true }, { class:"full-width" }%>